# Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали n журавликов.
# Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов, 
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
# Выведите через пробел количество журавликов, сделанных Петей, Катей и Сережей.

n = int (input("Введите сумму корабликов: "))
petyaAndSerj = int (n / 6)
katya = int ((petyaAndSerj + petyaAndSerj)*2)
print(f"{petyaAndSerj} {katya} {petyaAndSerj}")
# katya = int ((petyaAndSerj + petyaAndSerj)*2)
# n = katya + petyaAndSerj*2
# print(n)




